## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.a12-rg will be destroyed
  # (because azurerm_resource_group.a12-rg is not in configuration)
  - resource "azurerm_resource_group" "a12-rg" {
      - id       = "/subscriptions/a6e2dd04-2b6d-4edc-8a61-27d0a2867fe2/resourceGroups/rung1018-a12-rg" -> null
      - location = "westus3" -> null
      - name     = "rung1018-a12-rg" -> null
      - tags     = {} -> null
    }

  # azurerm_resource_group.a12_rg will be created
  + resource "azurerm_resource_group" "a12_rg" {
      + id       = (known after apply)
      + location = "westus3"
      + name     = "rung1018-a12-rg"
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "rung1018subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rung1018-a12-rg"
      + virtual_network_name                           = "rung1018vnet"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westus3"
      + name                = "rung1018vnet"
      + resource_group_name = "rung1018-a12-rg"
      + subnet              = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```
</details>